app/views/users/index.html.slim

            td style="width:80%"
              -if (user.courses.length > 0)
---
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = 1