app/views/users/show.html.slim

SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = 1
---
          .row-fluid
              -if (@user.courses.length > 0)