app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT DISTINCT "users".* FROM "users" LIMIT 20 OFFSET 0
---
  def index
    #user = User.find(:all, :conditions => "details_type = 'Company' OR 'Individual'")
    if params[:within].present? && (params[:within].to_i > 0)
      @q = User.near(params[:city], params[:within]).search(params[:q])
    else
      @q = User.search(params[:q])
    end
    #@q = @q.all(:conditions => "details_type = 'Company' OR 'Individual'")
    @users = @q.result(:distinct => true).page(params[:page]).per(20)

INSERT INTO "users" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "bio", "city", "country", "created_at", "details_id", "details_type", "email", "emailverified", "favoritecolor", "gmaps", "hourlyrate", "latitude", "longitude", "password_digest", "phonenumber", "slug", "state", "street", "token", "topics", "updated_at", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save

INSERT INTO "companies" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 30 Apr 2013 02:37:49 UTC +00:00], ["name", nil], ["updated_at", Tue, 30 Apr 2013 02:37:49 UTC +00:00]]
INSERT INTO "individuals" ("academiclevel", "academicyear", "actmathscore", "actscore", "ap", "avatar_content_type", "avatar_file_name", "avatar_file_size", "bio", "birthday", "city", "college", "country", "created_at", "details_id", "details_type", "email", "familyincome", "favoritecolor", "firstname", "foreignlanguage", "futurehopesanddreams", "gender", "goalinlife", "gpa", "highschool", "highschoolgpa", "hobbies", "hourlyrate", "lastname", "latitude", "longitude", "major", "mathclass", "password_digest", "phonenumber", "proficiencyacting", "proficiencyart", "proficiencybusiness", "proficiencycommunityservice", "proficiencydance", "proficiencyeconomics", "proficiencyforeignlanguage", "proficiencyleadership", "proficiencymath", "proficiencymusic", "proficiencypublicspeaking", "proficiencyreading", "proficiencyscience", "proficiencysocialstudies", "proficiencysports", "satmathscore", "satscore", "satverbalscore", "state", "street", "testscores", "token", "topics", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "purchasers" ("created_at", "firstname", "lastname", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 10 Mar 2013 11:51:04 UTC +00:00], ["firstname", nil], ["lastname", nil], ["updated_at", Sun, 10 Mar 2013 11:51:04 UTC +00:00]]
---
  def choseType
    @type = params[:commit]
    @user = current_user
    if (@type == "Company")
      @user.details = Company.new
      @user.save
    elsif (@type == "Individual")
      @user.details = Individual.new
      @user.save
    elsif (@type == "Parent/Student")
      @user.details = Purchaser.new
      @user.save