mentorhip/app/controllers/courses_controller.rb

  def create
    @course = current_user.courses.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("category", "created_at", "description", "enddate", "name", "ongoing", "price", "startdate", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def load_course
    @course = current_user.courses.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = 3