mentorhip/app/controllers/home_controller.rb

  def index
    @providers = User.find(:all,:conditions => "details_type = 'Company' OR details_type = 'Individual'");
    @users = User.all;
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = 2 LIMIT 1
SELECT "individuals".* FROM "individuals" WHERE "individuals"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE (details_type = 'Company' OR details_type = 'Individual')
SELECT "users".* FROM "users"